{
  "main": {
    "name":"Marcus D. Norwood",
    "description":"Portfolio & Resumé",
    "image":"profilepic.jpg",
    "bio":"11+ years of professional experience between web development, web design, system admin support, multimedia production, web project management & content management. I'm now starting to look for my next career position and adventure in IT.",
    "reactwebexperience":"The last 2+ years included using React, Node, Firebase (NoSQL) for personal and online course based projects. Learning to use Javascript libraries like Redux, Hooks, ContextAPI, GraphQL, etc. Including using Create React App, Gatsby, or NextJS. Relying on Git for version control and Heroku, Firebase and other workflows for hosting. I can use Styled-Components based CSS if in React for automatic BEM implementation.",
    "cmswebexperience":"I've also implemented and supported Content Management System solutions like Drupal & Wordpress for the last 5 years professionally. Utlizing more module based implementations with customization. Providing project managment, site building, and system admin support in a large enterprise site. Along with development, module updates, and more with a smaller instance.",
    "vanillawebexperience":"IN THE PAST I've built mobile first and responsive design implementations from the ground up with HTML, CSS/SASS, vanilla Javascript or jQuery and more. I'm flexible in design markup. Having used custom grids, flexbox, 3rd party grids like Bootstrap, CSS libraries like Tailwind, etc. I can use web animation libraries or CSS to create basic animation elements.",
    "netwebexperience":"FINALLY, I have past experience building projects with other web stacks like .Net MVC C#, .NET Webforms, classic ASP. As well working with various database types like SQL & MySQL. Although it's been a few years, I'd be happy to jump back into any stack if the situation is a good fit.",
    "projectmanagementexperience":"Roughly 5 years of Web Project Managment experience. Most recently working in my last position to help oversee a large system migration from single database CMS to a CRM + CMS dual database instance. Managing client office expectations, project QA and more. Working with a larger dev agency to assist on heavy lifting. The position also included general troubleshooting and project management for bugs or enhancements post launch. As well as managing many seperate section sites for the club for sub groups across the US and internationally.",    
    "multimediaexperience":"Years of experience with multimedia. Especially content production for the web. I understand web optimized images like JP2, JPX, JXR and WebP. Photoshop and Illustrator for normal SVG, PNG, JPG, WebP formats. As well as CLI to convert to more optimized formats. Editing graphics, implementing Font Icons, and much more to get the necessary design style. I have some past experience with Motion Graphics in After Effect. Along with general video production and editing. Especially formatting video and audio to fit the various playback requirements on the web or elsewhere.",
    "audioexperience":"Outside of my web career, I also have a passion for audio with 20+ years of hobbyist experience as a musician and recording engineer. Along with a bachelor of arts from BSU focused on audio production, sound design and more. So on the side, I offer mixing, mastering and audio repair services through Dale Street Studio, LLC. As well as beat licensing opportunities for artists. See my Audio Services link for more information on audio services.",
    "contactmessage":"Let me know if you have an exciting project that you know you'd like to work with me on, or if you'd just like to see if I'm insterested. I'd love to hear more!",
    "email": "marcus@dalestreetstudio.com",
    "phone": "",
    "github":"https://github.com/mdnorwood",
    "project":"",
    "address":{
      "street":"Dale Street Studio, LLC",
      "city":"Colorado Springs",
      "state":"Colorado",
      "zip": "80909"
    },
    "website": "https://dale-street-studio.web.app/",
    "resumedownload":"",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/marcus-dale-norwood/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/mdnorwood",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"A list of web & multimedia",
    "education":[
      {
        "school":"Zero to Mastery and other online courses",
        "degree":"Online Courses",
        "graduated":"",
        "description":"Completion of various online courses in web development over the last 10 years. Between Pluralsight and Udemy. Most recently completing the React + Firebase Zero to Mastery course. Amongst other courses or tutorials I'm always continuing to take as a life long learner."
      },
      {
        "school":"Ball State University",
        "degree":"Telecommunications - multimedia production",
        "graduated":"2009",
        "description":"A bachelor of arts in Telecommunications. With a focus on audio and multimedia production. That also included video and motion graphics, and web design, but a focus on studio engineering and sound design. Plus a minor in business technology for online systems."
      }
    ],
    "work":[
      {
        "company":"Dale Street Studio",
        "title":"Owner",
        "years":"Jan 2021 - Present",
        "description":"My LLC dedicated to supporting select contract clients with web development, web design, system admin support & multimedia production. As well as my audio projects."
      },
      {
        "company":"Mercedes-Benz Club of America",
        "title":"Web Project Manager, System Admin and Development",
        "years":"November 2016 - December 2020",
        "description":"Web Project Manager & System Admin of large primary enterprise CMS + CRM implementation. Full development support and maintenance on a separate CMS Section Services instance. Helped manage a large system migration with a complicated membership structure from a single CMS instance to a CMS + CRM with Drupal  + CiviCRM. Continued to manage projects, site building and troubleshooting through the new implementation. While supporting various Sections across the US and Canada for web support."
      },
      {
        "company":"ClosedOp",
        "title":"Full Stack Web Developer",
        "years":"July 2015 - July 2016",
        "description":"Full stack web development, database development and design utilizing .NET MVC, C# and SQL. Along with razor views and multimedia/graphics support. With a PPC focused startup company. I also helped handle Ad creation and more. 1 year contract."
      },
      {
        "company":"UTMB",
        "title":"Web Programmer II and Web Content Producer",
        "years":"April 2011 - June 2015",
        "description":"Web Production & Multimedia - Supporting the School of Nursing with multimedia and online courses before moving on to support the School of Health Professions as the primary web developer and content support, but from the Provost office web & systems team. Which included classic ASP and .NET web pages with SQL. As well as responsive HTML/CSS/JS builds."
      },
      {
        "company":"GCFB",
        "title":"Web Design and Development",
        "years":"Dec 2010 - April 2011",
        "description":"Implemented new HTML/CSS/JS site from the ground up with a custom code framework. Migrated hosts and implemented a new email marketing system to save the food bank money. As well as general IT training/support of food bank employees with a new inventory management database."
      },
      {
        "company":"Norwood Digital Design",
        "title":"Web Design and Development, Motion Graphics",
        "years":"Dec 2009 - Dec 2010",
        "description":"Fresh out of school and doing freelance projects in Houston/Galveston area at the time. It was my first taste of full time web design and development projects. Strictly static brochure design based sites at the time with minor PHP for contact forms. Building in my own custom CSS frameworks and elements. Before starting a long run as a full time employee for the next decade."
      },     {
        "company":"Before the web career",
        "title":"DJ & Barista",
        "years":"2000 - Dec 2009",
        "description":"A DJ and hobbyist audio producer. Doing gigs at clubs, bars, private parties, etc. As well as a weekly club residency. Involvement in various bands and groups at the time. Also spent time as an island Barista and coffee shop manager. Before going to school to finish a bachelor's degree in Telecommunications at Ball State University. Then getting into a web career."
      }
    ],
    "skills":[
      {
        "name":"Drupal",
        "level":"80%"
      },
      {
        "name":"WordPress",
        "level":"80%"
      },
      {
        "name":"React",
        "level":"90%"
      },
      {
        "name":"HTML5",
        "level":"95%"
      },
      {
        "name":"CSS/SASS",
        "level":"95%"
      },
      {
        "name":"Javascript",
        "level":"70%"
      },
      {
        "name":"Firebase",
        "level":"70%"
      },
      {
        "name":"Photoshop",
        "level":"90%"
      },
      {
        "name":"Video",
        "level":"60%"
      },
      {
        "name":"Audio, Graphics & Multimedia",
        "level":"90%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Dale Street Studio",
        "category":"Site for LLC and hub for various services",
        "image":"DaleStStudioLLC.jpg",
        "url":"https://dalestreetstudio.com/"
      },
      {
        "title":"Infinite Scroller API",
        "category":"An infinite scroller built to use the Unsplash API. With vanilla Javascript",
        "image":"infinite-scroller.jpg",
        "url":"https://mdnorwood.github.io/infinite-scroll-unsplash-api/"
      },
      {
        "title":"Tailwind CSS + AOS",
        "category":"A responsive site using Tailwind CSS. Plus implementing animations on scroll",
        "image":"Tailwind-css-animate-on-scroll.jpg",
        "url":"https://mdnorwood.github.io/tailwind-css-with-animate-on-scroll/"
      },
      {
        "title":"Crown Clothing Store",
        "category":"An e-commerce store with Create-React-App, Redux and Firebase",
        "image":"Crwn-clothing.jpg",
        "url":"https://mn-crwn-live.herokuapp.com/"
      },
            {
        "title":"LinkedIn Clone",
        "category":"React + Redux build with basic LinkedIn design and functionality through Firebase",
        "image":"LinkedIn-clone.jpg",
        "url":"https://linkedin-clone-f439a.web.app/"
      },
            {
        "title":"Monsters Rolodex",
        "category":"React Search by Name",
        "image":"monster-rolodex.jpg",
        "url":"https://mdnorwood.github.io/monsters-rolodex/"
      },
      {
        "title":"Famous Quote Generator",
        "category":"Vanilla javascript famous person quote generator",
        "image":"quote-generator.jpg",
        "url":"https://mdnorwood.github.io/quote-generator/"
      },
      {
        "title":"Light Dark Mode Example",
        "category":"Vanilla javascript to show Light/Dark mode functionality",
        "image":"light-dark-mode.jpg",
        "url":"https://mdnorwood.github.io/light-dark-mode/"
      },
      {
        "title":"CORS Anywhere Example",
        "category":"This API enables cross-origin requests to anywhere.",
        "image":"cors-anywhere.jpg",
        "url":"https://gentle-spire-09107.herokuapp.com/"
      }
    ]
  }
}
