{
  "main": {
    "name":"Marcus D. Norwood",
    "description":"Development | Design | Multimedia | Audio",
    "image":"profilepic.jpg",
    "bio":"A creative individual that has worked for various companies across the U.S. in the last decade+. Supporting their web and multimedia needs. I've recently started Dale Street Studio, LLC in 2021. A growing home based studio. To support my clients and grow my opportunities in both web and audio. Doing the things and projects that I love most. From the place I love most. So I can keep my overhead low and offer great rates. I'm also a life long learner. So I keep a stack of online courses available to jump on anytime I have a free moment. Udemy.com and YouTube being key components to that. Plus tinkering and noodling away on web dev or in the audio studio any chance I get. When not spending time with the family and helping with my youngest son's schoolwork during COVID times.",
    "webexperience":"I have 12 years of full-time professional experience between web development, design and admin support. Supporting a variety of infrastructures, strategies, and also doing project management. Where I'm now offering web development, design, and support services to select clients. I currently use React, Node, Firebase and Javascript libraries like Redux, Hooks, ContextAPI, GraphQL, etc. to develop unidirectional data flow, optimized, progressive app, SPA websites. Including using Create React App, Gatsby, or NextJS implementations. Relying on Git, Heroku, Firebase and other workflows for version control or hosting. I can also implement and am supporting solutions like Drupal 8/9 & Wordpress with drag and drop site editing features via Gutenburg; if needing a more module based CMS solution. I especially excel in responsive development with CSS/SASS markup no matter the stack. For web styling and markup, I try to implement BEM styling practices in architecture when possible. Especially why I prefer using Styled-Components in React. I also have past experience building projects with other web stacks like .Net MVC C#, .NET Webforms, classic ASP & vanilla HTML5/CSS/JS builds. As well working in various database types like SQL, MySQL or NoSQL depending on the stack at the time of the build. I'm also using Adobe XD to help mockup site designs if a client wants something completely customized. Going through the full design process and not a 3rd party contributed theme if wanting to invest in that process. I'm not a one size fits all type of developer. I like to work with the client and find the web stack, or a support model, that best make sense for their needs and budget. Then I dive in and get to work.",
    "multimediaexperience":"I lean on the Adobe Creative Cloud suite with plently of experience in graphic design via Photoshop and Illustrator. Which is always a part of the web dev and support processes. More importantly as a web developer, I understand web optimized image types like JP2, JPX, JXR and WebP. I also have some experience with Motion Graphics in After Effects and on the web. Plus general video production and editing. Especially formatting to fit the various playback on the web or elsewhere.",
    "audioexperience":"I also specialize in audio with having 20+ years of past experience in various forms. From being a musician, former Dj. Along with a bachelor's in arts from BSU focused on audio production. production, sound design, and studio engineering.  Plus being a musician and former Dj. I'm now offering professional audio services with a modern hybrid analog/digital chain for mixing, mastering and audio repair. Plus production with publishing opportunities as I grow and bring on more artist based clients to support. See more from Dale Street Studio - Audio (coming soon) for more information.",
    "contactmessage":"Let me know if you have an exciting project that you know you'd like to work with me on, or if you'd just like to see if I'm insterested. I'd love to hear more!",
    "email": "dale.street.studio.com",
    "phone": "",
    "github":"https://github.com/mdnorwood",
    "project":"",
    "address":{
      "street":"Dale Street Studio, LLC",
      "city":"Colorado Springs",
      "state":"Colorado",
      "zip": "80909"
    },
    "website": "",
    "resumedownload":"",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/dalestreetstudio",
        "className":"fa fa-facebook"
      },
      {
        "name":"linkedin",
        "url":"#",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/marcusdnorwood/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/mdnorwood",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"A list of web & multimedia",
    "education":[
      {
        "school":"Zero to Mastery",
        "degree":"Online Courses",
        "graduated":"2019 to Now",
        "description":"Completion of various online courses in web development over the years. Between Pluralsight and Udemy. Completing the React + Firebase course in Zero to Mastery. Amongst many other web development and design based courses in the past. Continuing to take various courses."
      },
      {
        "school":"Ball State University",
        "degree":"Multimedia Production - Telecommunications",
        "graduated":"2009",
        "description":"A bachelors of arts with a focus on multimedia production. Inludung video and motion grpahics production, web design, audio engineering and sound design. Plus a minor in business technology."
      }
    ],
    "work":[
      {
        "company":"Dale Street Studio",
        "title":"Owner",
        "years":"Jan 2021 - Present",
        "description":"My LLC dedicated to supporting select contract clients with web development, web design, system support & multimedia production. As well as professional audio services for a separate client base."
      },
      {
        "company":"Mercedes-Benz Club of America",
        "title":"Web Project Manager, System Admin and Development",
        "years":"November 2016 - December 2020",
        "description":"Web Project Manager & System Admin of large primary enterprise CMS + CRM implementation. Full development support and maintenance on a separate CMS Section Services instance."
      },
      {
        "company":"ClosedOp",
        "title":"Full Stack Web Developer",
        "years":"July 2015 - July 2016",
        "description":"Full stack web development, database development and design utilizing .NET MVC, C# and SQL. Along with razor views and multimedia/graphics support."
      },
      {
        "company":"UTMB",
        "title":"Web Programmer II and Web Content Producer",
        "years":"April 2011 - June 2015",
        "description":"Web Production & Multimedia - Supporting the School of Nursing with multimedia and online courses before moving on to support the School of Health Professions as the primary web developer and content support, but from the Provost office web & systems team. Which included classic ASP and .NET web pages with SQL. As well as responsive HTML/CSS/JS builds."
      },
      {
        "company":"GCFB",
        "title":"Web Design and Development",
        "years":"Dec 2010 - April 2011",
        "description":"Implemented new HTML/CSS/JS site from the ground up with a custom code framework. Migrated hosts and implemented a new email marketing system to save the food bank money. As well as general IT training/support of food bank employees with a new inventory management database."
      },
      {
        "company":"Norwood Digital Design",
        "title":"Web Design and Development, Motion Graphics",
        "years":"Dec 2009 - Dec 2010",
        "description":"Fresh out of school and doing freelance projects in Houston/Galveston area at the time. It was my first taste of full time web design and development projects. Strictly static brochure design based sites at the time with minor PHP for contact forms. Building in my own custom CSS frameworks and elements. Before starting a long run as a full time employee for the next decade."
      },     {
        "company":"Before the web career",
        "title":"DJ & Audio Producer",
        "years":"2000 - Dec 2009",
        "description":"A professional DJ and hobbyist audio producer. Doing gigs in Clubs, bars, private parties all over the U.S. As well as a weekly club residency in Galveston, TX at the Gravity Bar. Including involvement in various bands as a producer and dj. Also spent time as an island Barista and coffee shop manager. Before going back to school in 2008 to finish a bachelor's degree in Telecommunications - Multimedia Production."
      }
    ],
    "skills":[
      {
        "name":"Drupal",
        "level":"80%"
      },
      {
        "name":"WordPress",
        "level":"70%"
      },
      {
        "name":"React",
        "level":"90%"
      },
      {
        "name":"HTML5",
        "level":"95%"
      },
      {
        "name":"CSS/SASS",
        "level":"95%"
      },
      {
        "name":"Javascript",
        "level":"80%"
      },
      {
        "name":"Firebase",
        "level":"70%"
      },
      {
        "name":"Photoshop",
        "level":"90%"
      },
      {
        "name":"Video",
        "level":"80%"
      },
      {
        "name":"Motion Graphics",
        "level":"70%"
      },
      {
        "name":"Audio",
        "level":"90%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Crown Clothing Store",
        "category":"A fully functional e-commerce store with Create-React-App & Redux; with a modern and clean UI",
        "image":"Crwn-clothing.jpg",
        "url":"https://mn-crwn-live.herokuapp.com/"
      },
      {
        "title":"Infinite Scroller API",
        "category":"An infinite scroller built to use the Unsplash API. With vanilla Javascript",
        "image":"infinite-scroller.jpg",
        "url":"https://mdnorwood.github.io/infinite-scroll-unsplash-api/"
      },
      {
        "title":"Famous Quote Generator",
        "category":"Vanilla javascript famous person quote generator",
        "image":"quote-generator.jpg",
        "url":"https://mdnorwood.github.io/quote-generator/"
      }
    ]
  }
}
